Repository: eunhyekoo/glo_project
Catalog: feedback/TMData/[Naver] WEBTOON ID>EN Who's Mr. President.tmx
Source language: id
Languages: en

source: HOI, AKU TAHU KAMU SENANG KARENA WAKATOS TERNYATA TIDAK MARAH DENGANMU...
en: look, I know you’re relieved to learn that she wasn’t mad at you...

source: KEJADIAN DI MASA
en: of

source: SELURUH SEKOLAH
en: the whole school that you have a crush

source: UNTUK APA JUGA
en: Besides,

source: apa-apa?
en: anything...

source: OLEH GURU, LOH!
en: highly of you, chiara!

source: JADI, BEGINILAH
en: Here’s the

source: MENERIMA MURID BEASISWA
en: for accepting a scholarship student

source: PAK NEVADA.
en: of Mr. Nevada.

source: Kak Chia sama Kakak yang seram itu pacaran ya?
en: are you and that scary guy together?

source: MEMANFAATKAN
en: is taking advantage
